# Написать скрипт, который переконвертирует строку в целочисленное
# Пример:
# ["12", "15", "16", "17"] до
# [12, 15, 16, 17] после
# Требование:
# Использовать list comprehension


nums = ['12', '15', '16', '17']
nums1 = [int(x) for x in nums]
print(nums1)