# Написать скрипт, который меняет каждое число 
# на квадрат данного числа
# Пример:
# [[1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12]] - до
# #[[1, 4, 9, 16], [25, 36, 49, 64], [81, 100, 121, 144]] - после
# Требование:
# Использовать list comprehension
# Подсказка:
# Nested list comprehension


nums =[12 , 5, 2, 3], [3, 4, 8, 7], [11, 9, 14]
# nums2 = [x * x for x in (12, 5, 2, 3)] , [x * x for x in (3, 4, 8, 7)], [x *x for x in (11, 9, 14)]
# print(nums2)


nums2 = [[num **2 for num in nana] for nana in nums]
print(nums2)

